Revit 2024 API
BuiltInFailures.MassFailures.FloorRecreateFailed Property
 The floor cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FloorRecreateFailed { get; }
Visual Basic
Public Shared ReadOnly Property FloorRecreateFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FloorRecreateFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace